/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   echo.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: eunjungbang <eunjungbang@student.42.fr>    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/03 06:36:28 by eunjungbang       #+#    #+#             */
/*   Updated: 2023/01/03 06:36:48 by eunjungbang      ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../inc/minish.h"

//@brief  stdout 으로 지정된 fd로 command 인자를 출력
//TODO : @성공 시, 실패시 반환 값
//궁금한 점: pipe, redirection 의 경우, stdout을 미리 변경한 후에 실행하면 되나?

void echo()
{
   

}